\begin{center}\begin{minipage}{15cm}\begin{Verbatim}[frame=single]
> f = exp(x);
> f;
exp(x)
> a = "Hello world";
> a;
Hello world
> b = 5;
> f(b);
Warning: rounding has happened. The value displayed is a faithful rounding to 16
5 bits of the true result.
148.41315910257660342111558004055227962348766759388
> {var b; b = 4; f(b); };
Warning: rounding has happened. The value displayed is a faithful rounding to 16
5 bits of the true result.
54.598150033144239078110261202860878402790737038614
> {var x; x = 3; };
Warning: the identifier "x" is already bound to the current free variable.
It cannot be declared as a local variable. The declaration of "x" will have no e
ffect.
Warning: the identifier "x" is already bound to the free variable, to a library 
function, library constant or to an external procedure.
The command will have no effect.
Warning: the last assignment will have no effect.
> {var a, b; a=5; b=3; {var a; var b; b = true; a = 1; a; b;}; a; b; };
1
true
5
3
> a;
Hello world
\end{Verbatim}
\end{minipage}\end{center}
